---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.HVACLoadBuildingType
source: html/9e6e80c2-348d-b585-677a-c90929810f71.htm
---
# HVACLoadBuildingType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.